tests/load/scenarios.yml
config:
  target: "https://zq3oc7n5e8.execute-api.us-east-1.amazonaws.com/prod-v2"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 5
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "WhatsApp Webhook Storm"
    flow:
      - post:
          url: "/webhook"
          json:
            object: "whatsapp_business_account"
            entry:
              - id: "105956415951616"
                changes:
                  - value:
                      messaging_product: "whatsapp"
                      metadata:
                        display_phone_number: "15550257976"
                        phone_number_id: "101602696388484"
                      contacts:
                        - profile:
                            name: "Load Tester"
                          wa_id: "12065550123"
                      messages:
                        - from: "12065550123"
                          id: "wamid.HBgLMTIwNjU1NTAxMjMVAgASGBQzQUMwMTVDREZDQTA3RUE5NTY3AA=="
                          timestamp: "1715367612"
                          text:
                            body: "Is this load test working?"
                          type: "text"
                    field: "messages"
  
  - name: "Billing API Polling"
    flow:
      - get:
          url: "/billing/usage?tenantId=tenant-123"
          headers:
            x-tenant-id: "tenant-123"